ronaldsieber/ESP32BleConfig/ESP32BleConfig/ESP32BleCfgProfile.cpp
/****************************************************************************

  Copyright (c) 2021 Ronald Sieber

  Project:      Project independend / Standard class
  Description:  Class <ESP32BleCfgProfile> Implementation

  -------------------------------------------------------------------------

    Calculation of Handles required for function <BLEServer::createService>:
        1 Handle for the Service itself
      + 2 Handles for each Characteristic
      + 1 Handle for each Despcription

    (see: https://esp32.com/viewtopic.php?t=7452)

  -------------------------------------------------------------------------

  Revision History:

  2021/07/06 -rs:   V1.00 Initial version

****************************************************************************/


#include "Arduino.h"
#include <BLEDevice.h>
#include <BLEServer.h>
#include "ESP32BleCfgProfile.h"

#define DEBUG                                                           // Enable/Disable TRACE
#include "Trace.h"





/***************************************************************************/
/*                                                                         */
/*                                                                         */
/*          CLASS  ESP32BleCfgProfile                                      */
/*                                                                         */
/*                                                                         */
/***************************************************************************/

/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//          P R I V A T E   A T T R I B U T E S                            //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////

//---------------------------------------------------------------------------
//  BLE specific Definitions
//---------------------------------------------------------------------------
//
// CONVENTION:
//
// In a GUID of a Characteristic the 1st group specifies the Characteristic purpose,
// while the 2nd group is always '0000'. A Descriptor uses in its 1st group the same
// value as it's assoziated Characteristic, but with a value unequal '0000' in the
// 2nd group. For the first Descriptor the value '0001' is used. This scheme allows
// multiple Descriptors for one Characteristic in the future by continue numbering
// with '0002' etc. However, this implementation always uses only the first descriptor
// ('001').
//
// Sample:
// GUID Characteristic:         "00003100-0000-1000-8000-E776CC14FE69"
// GUID Offset Descriptor:      "00000000-0001-0000-0000-000000000000"
//                              --------------------------------------
// Resulting Descriptor GUID:   "00003100-0001-1000-8000-E776CC14FE69"
//

static  const int    NUM_HANDLES_DEVMNT_SERVICE             = 16;               // = (1*Service + 2*Characteristics + 1*Descriptions)
static  const char*  BLE_UUID_DEVMNT_SERVICE                = "00001000-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_DEVTYPE_CHARACTRSTC    = "00001100-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_DEVTYPE_DSCRPT         = "00001100-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_SYSTICKCNT_CHARACTRSTC = "00001200-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_SYSTICKCNT_DSCRPT      = "00001200-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_DEVNAME_CHARACTRSTC    = "00001300-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_DEVNAME_DSCRPT         = "00001300-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_SAVE_CFG_CHARACTRSTC   = "00001400-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_SAVE_CFG_DSCRPT        = "00001400-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_RST_DEV_CHARACTRSTC    = "00001500-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_DEVMNT_RST_DEV_DSCRPT         = "00001500-0001-1000-8000-E776CC14FE69";

static  const int    NUM_HANDLES_WIFI_SERVICE               = 14;               // = (1*Service + 2*Characteristics + 1*Descriptions)
static  const char*  BLE_UUID_WIFI_SERVICE                  = "00002000-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_SSID_CHARACTRSTC         = "00002100-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_SSID_DSCRPT              = "00002100-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_PASSWD_CHARACTRSTC       = "00002200-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_PASSWD_DSCRPT            = "00002200-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_OWNADDR_CHARACTRSTC      = "00002300-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_OWNADDR_DSCRPT           = "00002300-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_OWNMODE_CHARACTRSTC      = "00002400-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_OWNMODE_DSCRPT           = "00002400-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_WIFI_OWNMODE_DSCRPT_FEATLIST  = "00002400-0002-1000-8000-E776CC14FE69";

static  const int    NUM_HANDLES_APP_RT_SERVICE             = 28;               // = (1*Service + 2*Characteristics + 1*Descriptions)
static  const char*  BLE_UUID_APP_RT_SERVICE                = "00003000-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT1_CHARACTRSTC       = "00003100-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT1_DSCRPT            = "00003100-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT2_CHARACTRSTC       = "00003200-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT2_DSCRPT            = "00003200-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT3_CHARACTRSTC       = "00003300-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT3_DSCRPT            = "00003300-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT4_CHARACTRSTC       = "00003400-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT4_DSCRPT            = "00003400-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT5_CHARACTRSTC       = "00003500-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT5_DSCRPT            = "00003500-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT6_CHARACTRSTC       = "00003600-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT6_DSCRPT            = "00003600-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT7_CHARACTRSTC       = "00003700-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT7_DSCRPT            = "00003700-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT8_CHARACTRSTC       = "00003800-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_OPT8_DSCRPT            = "00003800-0001-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_PEERADDR_CHARACTRSTC   = "00003900-0000-1000-8000-E776CC14FE69";
static  const char*  BLE_UUID_APP_RT_PEERADDR_DSCRPT        = "00003900-0001-1000-8000-E776CC14FE69";



//---------------------------------------------------------------------------
//  Module Local Variables
//---------------------------------------------------------------------------

// The main class ESP32BleCfgProfile and the local callback classes declared
// below require common access to the variables created here. For this reason,
// the variables cannot be declared as members of the class ESP32BleCfgProfile,
// but must be created as module local variables.

