ronaldsieber/ESP32BleConfig/ESP32BleConfig/ESP32BleCfgProfile.cpp
static  bool                fBleClientConnected_g           = false;

static  tCbHdlrSaveConfig   pfnAppCbHdlrSaveConfig_g        = NULL;
static  tCbHdlrRestartDev   pfnAppCbHdlrRestartDev_g        = NULL;
static  tCbHdlrConStatChg   pfnAppCbHdlrConStatChg_g        = NULL;

static  BLEServer*          pBleServer_g                    = NULL;

static  BLEService*         pBleServiceDevMnt_g             = NULL;
static  BLECharacteristic*  pBleCharacDevMntDevType_g       = NULL;
static  BLECharacteristic*  pBleCharacDevMntSysTickCnt_g    = NULL;
static  BLECharacteristic*  pBleCharacDevMntDevName_g       = NULL;
static  BLECharacteristic*  pBleCharacDevMntSaveCfg_g       = NULL;
static  BLECharacteristic*  pBleCharacDevMntRstDev_g        = NULL;

static  BLEService*         pBleServiceWifi_g               = NULL;
static  BLECharacteristic*  pBleCharacWifiSSID_g            = NULL;
static  BLECharacteristic*  pBleCharacWifiPasswd_g          = NULL;
static  BLECharacteristic*  pBleCharacWifiOwnAddr_g         = NULL;
static  BLECharacteristic*  pBleCharacWifiOwnMode_g         = NULL;

static  BLEService*         pBleServiceAppRt_g              = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt1_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt2_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt3_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt4_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt5_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt6_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt7_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtOpt8_g           = NULL;
static  BLECharacteristic*  pBleCharacAppRtPeerAddr_g       = NULL;


static  uint32_t            ui32DevMntDevType_g             = 0;
static  uint32_t            ui32DevMntSysTickCnt_g          = 0;
static  char                szDevMntDevName_g[32]           = { '\0' };     // "{ESP32_BLE_DEVICE}"
static  uint16_t            ui16DevMntSaveCfg_g             = 0;
static  uint16_t            ui16DevMntRstDev_g              = 0;

static  char                szWifiSSID_g[32]                = { '\0' };     // "{Enter WIFI SSID Name}"
static  char                szWifiPasswd_g[64]              = { '\0' };     // "{Enter WIFI Password}"
static  char                szWifiOwnAddr_g[24]             = { '\0' };     // "{0.0.0.0:0}"
static  uint16_t            ui16WifiOwnMode_g               = 0;            // WIFI_OPMODE_STA / WIFI_OPMODE_AP

static  uint16_t            ui16AppRtOpt1_g                 = 0;
static  uint16_t            ui16AppRtOpt2_g                 = 0;
static  uint16_t            ui16AppRtOpt3_g                 = 0;
static  uint16_t            ui16AppRtOpt4_g                 = 0;
static  uint16_t            ui16AppRtOpt5_g                 = 0;
static  uint16_t            ui16AppRtOpt6_g                 = 0;
static  uint16_t            ui16AppRtOpt7_g                 = 0;
static  uint16_t            ui16AppRtOpt8_g                 = 0;
static  char                szAppRtPeerAddr_g[24]           = { '\0' };     // "{0.0.0.0:0}"





//=========================================================================//
//                                                                         //
//          B L E   C A L L B A C K   C L A S S E S                        //
//                                                                         //
//=========================================================================//

//---------------------------------------------------------------------------
//  Class BleServerAppCallbacks
//---------------------------------------------------------------------------

class  BleServerAppCallbacks : public BLEServerCallbacks
{

    void onConnect(BLEServer* pBleServer_p)
    {
        fBleClientConnected_g = true;

        if (pfnAppCbHdlrConStatChg_g != NULL)
        {
            pfnAppCbHdlrConStatChg_g(fBleClientConnected_g);
        }
        return;
    };

    //-------------------------------------------------------------------
    void onDisconnect(BLEServer* pBleServer_p)
    {
        fBleClientConnected_g = false;

        if (pfnAppCbHdlrConStatChg_g != NULL)
        {
            pfnAppCbHdlrConStatChg_g(fBleClientConnected_g);
        }
        return;
    };

};



//---------------------------------------------------------------------------
//  Class BleCharacteristicDevMntSaveConfigCallbacks
//---------------------------------------------------------------------------

class  BleCharacteristicDevMntSaveConfigCallbacks : public BLECharacteristicCallbacks
{

    void onWrite(BLECharacteristic* pBleCharacteristic_p)
    {

        tAppCfgData  AppCfgData;
        bool         fSuccess;
        int          iRes;

        fSuccess = ESP32BleCfgProfile::ReadDataFromBleCharacterisics();
        if ( fSuccess )
        {
            if (pfnAppCbHdlrSaveConfig_g != NULL)
            {
                iRes = ESP32BleCfgProfile::ExportInstanceWorkspace(&AppCfgData);
                if (iRes >= 0)
                {
                    pfnAppCbHdlrSaveConfig_g(&AppCfgData);
                }
                else
                {
                    pfnAppCbHdlrSaveConfig_g(NULL);
                }
            }
        }

        return;

    }

};



//---------------------------------------------------------------------------
//  Class BleCharacteristicDevMntRestartDevCallbacks
//---------------------------------------------------------------------------

class  BleCharacteristicDevMntRestartDevCallbacks : public BLECharacteristicCallbacks
{

    void onWrite(BLECharacteristic* pBleCharacteristic_p)
    {

        if (pfnAppCbHdlrRestartDev_g != NULL)
        {
            pfnAppCbHdlrRestartDev_g();
        }

        return;

