ronaldsieber/ESP32BleConfig/ESP32BleConfig/ESP32BleCfgProfile.cpp
    }

};





/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//          C O N S T R U C T O R   /   D E S T R U C T O R                //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////

//---------------------------------------------------------------------------
//  Constructor
//---------------------------------------------------------------------------

ESP32BleCfgProfile::ESP32BleCfgProfile ()
{

    fBleClientConnected_g           = false;

    pfnAppCbHdlrSaveConfig_g        = NULL;
    pfnAppCbHdlrRestartDev_g        = NULL;

    pBleServer_g                    = NULL;

    pBleServiceDevMnt_g             = NULL;
    pBleCharacDevMntDevType_g       = NULL;
    pBleCharacDevMntSysTickCnt_g    = NULL;
    pBleCharacDevMntDevName_g       = NULL;
    pBleCharacDevMntSaveCfg_g       = NULL;
    pBleCharacDevMntRstDev_g        = NULL;

    pBleServiceWifi_g               = NULL;
    pBleCharacWifiSSID_g            = NULL;
    pBleCharacWifiPasswd_g          = NULL;
    pBleCharacWifiOwnAddr_g         = NULL;
    pBleCharacWifiOwnMode_g         = NULL;

    pBleServiceAppRt_g              = NULL;
    pBleCharacAppRtOpt1_g           = NULL;
    pBleCharacAppRtOpt2_g           = NULL;
    pBleCharacAppRtOpt3_g           = NULL;
    pBleCharacAppRtOpt4_g           = NULL;
    pBleCharacAppRtOpt5_g           = NULL;
    pBleCharacAppRtOpt6_g           = NULL;
    pBleCharacAppRtOpt7_g           = NULL;
    pBleCharacAppRtOpt8_g           = NULL;
    pBleCharacAppRtPeerAddr_g       = NULL;

    return;

}



//---------------------------------------------------------------------------
//  Destructor
//---------------------------------------------------------------------------

ESP32BleCfgProfile::~ESP32BleCfgProfile()
{

    return;

}





/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//          P U B L I C    M E T H O D E S                                 //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////

//---------------------------------------------------------------------------
//  ProfileSetup()
//---------------------------------------------------------------------------

int  ESP32BleCfgProfile::ProfileSetup (
        uint32_t ui32DeviceType_p,
        const tAppCfgData* pAppCfgData_p,
        const tAppDescriptData* pAppDescriptData_p,
        tCbHdlrSaveConfig pfnAppCbHdlrSaveConfig_p,
        tCbHdlrRestartDev pfnAppCbHdlrRestartDev_p,
        tCbHdlrConStatChg pfnAppCbHdlrConStatChg_p)
{

BLEDescriptor*  pBleDescriptor;
uint16_t        ui16OwnModeFeatList;
int             iRes;


    TRACE1("+ 'ProfileSetup()': ui32DeviceType_p=%d\n", ui32DeviceType_p);

    // Import configuration data given by Application into class instance workspace
    ui32DevMntDevType_g = ui32DeviceType_p;
    iRes = ImportInstanceWorkspace(pAppCfgData_p);
    if (iRes < 0)
    {
        return (-1);
    }

    // Save Pointer to Application Callback Handlers for 'SaveCfg' and 'RestartDev' as well as optional Handler 'ConnectionStatusChanged'
    pfnAppCbHdlrSaveConfig_g = pfnAppCbHdlrSaveConfig_p;
    pfnAppCbHdlrRestartDev_g = pfnAppCbHdlrRestartDev_p;
    pfnAppCbHdlrConStatChg_g = pfnAppCbHdlrConStatChg_p;
    if ((pfnAppCbHdlrSaveConfig_g == NULL) || (pfnAppCbHdlrRestartDev_g == NULL))
    {
        return (-2);
    }


    //****************[ SERVER ]****************
    BLEDevice::init(szDevMntDevName_g);             // e.g. "ESP32-BEACON"
    pBleServer_g = BLEDevice::createServer();
    pBleServer_g->setCallbacks(new BleServerAppCallbacks());


    // ======= [ SERVICE #1 [Device Management] ] =======
    {
        TRACE0("   SERVICE #1 [Device Management]\n");
        pBleServiceDevMnt_g = pBleServer_g->createService(BLEUUID(BLE_UUID_DEVMNT_SERVICE), NUM_HANDLES_DEVMNT_SERVICE, 0);

        // ---- [ CHARACTERISTIC #1 [DevMnt/DevType] ] ----
        {
            TRACE0("     CHARACTERISTIC #1 [DevMnt/DevType]\n");
            pBleCharacDevMntDevType_g = pBleServiceDevMnt_g->createCharacteristic(
                                                            BLE_UUID_DEVMNT_DEVTYPE_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ
                                                        );
            pBleCharacDevMntDevType_g->setValue(ui32DevMntDevType_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_DEVMNT_DEVTYPE_DSCRPT);
            pBleDescriptor->setValue("Device Type");
            pBleCharacDevMntDevType_g->addDescriptor(pBleDescriptor);
        }

        // ---- [ CHARACTERISTIC #2 [DevMnt/SysTickCnt] ] ----
        {
            TRACE0("     CHARACTERISTIC #2 [DevMnt/SysTickCnt]\n");
            pBleCharacDevMntSysTickCnt_g = pBleServiceDevMnt_g->createCharacteristic(
                                                            BLE_UUID_DEVMNT_SYSTICKCNT_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacDevMntSysTickCnt_g->setValue(ui32DevMntSysTickCnt_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_DEVMNT_SYSTICKCNT_DSCRPT);
            pBleDescriptor->setValue("System Tick Count");
            pBleCharacDevMntSysTickCnt_g->addDescriptor(pBleDescriptor);
        }

        // ---- [ CHARACTERISTIC #3 [DevMnt/DevName] ] ----
        {
            TRACE0("     CHARACTERISTIC #3 [DevMnt/DevName]\n");
            pBleCharacDevMntDevName_g = pBleServiceDevMnt_g->createCharacteristic(
                                                            BLE_UUID_DEVMNT_DEVNAME_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacDevMntDevName_g->setValue(szDevMntDevName_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_DEVMNT_DEVNAME_DSCRPT);
            pBleDescriptor->setValue("Device Name");
            pBleCharacDevMntDevName_g->addDescriptor(pBleDescriptor);
        }

        // ---- [ CHARACTERISTIC #4 [DevMnt/SaveConfig] ] ----
        {
            TRACE0("     CHARACTERISTIC #4 [DevMnt/SaveConfig]\n");
            pBleCharacDevMntSaveCfg_g = pBleServiceDevMnt_g->createCharacteristic(
                                                            BLE_UUID_DEVMNT_SAVE_CFG_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_WRITE
                                                        );
            pBleDescriptor = new BLEDescriptor(BLE_UUID_DEVMNT_SAVE_CFG_DSCRPT);
            pBleDescriptor->setValue("Save Conig");
            pBleCharacDevMntSaveCfg_g->addDescriptor(pBleDescriptor);
            pBleCharacDevMntSaveCfg_g->setCallbacks(new BleCharacteristicDevMntSaveConfigCallbacks());
        }

        // ---- [ CHARACTERISTIC #5 [DevMnt/RstDev] ] ----
        {
            TRACE0("     CHARACTERISTIC #5 [DevMnt/RstDev]\n");
            pBleCharacDevMntRstDev_g = pBleServiceDevMnt_g->createCharacteristic(
                                                            BLE_UUID_DEVMNT_RST_DEV_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_WRITE
                                                        );
            pBleDescriptor = new BLEDescriptor(BLE_UUID_DEVMNT_RST_DEV_DSCRPT);
            pBleDescriptor->setValue("Restart Device");
            pBleCharacDevMntRstDev_g->addDescriptor(pBleDescriptor);
            pBleCharacDevMntRstDev_g->setCallbacks(new BleCharacteristicDevMntRestartDevCallbacks());
        }

        pBleServiceDevMnt_g->start();
    }


    // ======= [ SERVICE #2 [WIFI Config] ] =======
    {
        TRACE0("   SERVICE #2 [WIFI Config]\n");
        pBleServiceWifi_g = pBleServer_g->createService(BLEUUID(BLE_UUID_WIFI_SERVICE), NUM_HANDLES_WIFI_SERVICE, 0);

        // ---- [ CHARACTERISTIC #1 [Wifi/SSID] ] ----
        {
            TRACE0("     CHARACTERISTIC #1 [Wifi/SSID]\n");
            pBleCharacWifiSSID_g = pBleServiceWifi_g->createCharacteristic(
                                                            BLE_UUID_WIFI_SSID_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacWifiSSID_g->setValue(szWifiSSID_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_WIFI_SSID_DSCRPT);
            pBleDescriptor->setValue("WIFI SSID");
            pBleCharacWifiSSID_g->addDescriptor(pBleDescriptor);
        }

        // ---- [ CHARACTERISTIC #2 [Wifi/Passwd] ] ----
        {
            TRACE0("     CHARACTERISTIC #2 [Wifi/Passwd]\n");
            pBleCharacWifiPasswd_g = pBleServiceWifi_g->createCharacteristic(
                                                            BLE_UUID_WIFI_PASSWD_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacWifiPasswd_g->setValue(szWifiPasswd_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_WIFI_PASSWD_DSCRPT);
            pBleDescriptor->setValue("WIFI PASSWD");
            pBleCharacWifiPasswd_g->addDescriptor(pBleDescriptor);
        }

        // ---- [ CHARACTERISTIC #3 [Wifi/OwnAddr] ] ----
        {
            TRACE0("     CHARACTERISTIC #3 [Wifi/OwnAddr]\n");
            pBleCharacWifiOwnAddr_g = pBleServiceWifi_g->createCharacteristic(
                                                            BLE_UUID_WIFI_OWNADDR_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacWifiOwnAddr_g->setValue(szWifiOwnAddr_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_WIFI_OWNADDR_DSCRPT);
            pBleDescriptor->setValue("Own Address");
            pBleCharacWifiOwnAddr_g->addDescriptor(pBleDescriptor);
        }

        // ---- [ CHARACTERISTIC #4 [Wifi/OwnMode] ] ----
        {
            TRACE0("     CHARACTERISTIC #4 [Wifi/OwnMode]\n");
            pBleCharacWifiOwnMode_g = pBleServiceWifi_g->createCharacteristic(
                                                            BLE_UUID_WIFI_OWNMODE_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacWifiOwnMode_g->setValue((uint16_t&)ui16WifiOwnMode_g);
            pBleDescriptor = new BLEDescriptor(BLE_UUID_WIFI_OWNMODE_DSCRPT);
            pBleDescriptor->setValue("Own Mode");
            pBleCharacWifiOwnMode_g->addDescriptor(pBleDescriptor);
            if (pAppDescriptData_p != NULL)
            {
                // set descriptor with supported WIFI modes (Station/Client, AccessPoint)
                ui16OwnModeFeatList = (uint16_t) pAppDescriptData_p->m_ui8OwnModeFeatList;
                pBleDescriptor = new BLEDescriptor(BLE_UUID_WIFI_OWNMODE_DSCRPT_FEATLIST);
                pBleDescriptor->setValue((uint8_t*)&ui16OwnModeFeatList, sizeof(ui16OwnModeFeatList));
                pBleCharacWifiOwnMode_g->addDescriptor(pBleDescriptor);
            }
        }

        pBleServiceWifi_g->start();
    }


    // ======= [ SERVICE #3 [APP RT Config] ] =======
    {
        TRACE0("   SERVICE #3 [APP RT Config]\n");
        pBleServiceAppRt_g = pBleServer_g->createService(BLEUUID(BLE_UUID_APP_RT_SERVICE), NUM_HANDLES_APP_RT_SERVICE, 0);

