ronaldsieber/ESP32BleConfig/ESP32BleConfig/ESP32BleCfgProfile.cpp
        // ---- [ CHARACTERISTIC #1 [AppRt/Opt1] ] ----
        {
            TRACE0("     CHARACTERISTIC #1 [AppRt/Opt1]\n");
            pBleCharacAppRtOpt1_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT1_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt1_g->setValue((uint16_t&)ui16AppRtOpt1_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt1 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT1_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt1);
                pBleCharacAppRtOpt1_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #2 [AppRt/Opt2] ] ----
        {
            TRACE0("     CHARACTERISTIC #2 [AppRt/Opt2]\n");
            pBleCharacAppRtOpt2_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT2_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt2_g->setValue((uint16_t&)ui16AppRtOpt2_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt2 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT2_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt2);
                pBleCharacAppRtOpt2_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #3 [AppRt/Opt3] ] ----
        {
            TRACE0("     CHARACTERISTIC #3 [AppRt/Opt3]\n");
            pBleCharacAppRtOpt3_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT3_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt3_g->setValue((uint16_t&)ui16AppRtOpt3_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt3 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT3_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt3);
                pBleCharacAppRtOpt3_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #4 [AppRt/Opt4] ] ----
        {
            TRACE0("     CHARACTERISTIC #4 [AppRt/Opt4]\n");
            pBleCharacAppRtOpt4_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT4_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt4_g->setValue((uint16_t&)ui16AppRtOpt4_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt4 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT4_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt4);
                pBleCharacAppRtOpt4_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #5[AppRt/Opt5] ] ----
        {
            TRACE0("     CHARACTERISTIC #5 [AppRt/Opt5]\n");
            pBleCharacAppRtOpt5_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT5_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt5_g->setValue((uint16_t&)ui16AppRtOpt5_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt5 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT5_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt5);
                pBleCharacAppRtOpt5_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #6 [AppRt/Opt6] ] ----
        {
            TRACE0("     CHARACTERISTIC #6 [AppRt/Opt6]\n");
            pBleCharacAppRtOpt6_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT6_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt6_g->setValue((uint16_t&)ui16AppRtOpt6_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt6 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT6_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt6);
                pBleCharacAppRtOpt6_g->addDescriptor(pBleDescriptor);
            }
        }

