ronaldsieber/ESP32BleConfig/ESP32BleConfig/ESP32BleCfgProfile.cpp
        // ---- [ CHARACTERISTIC #7 [AppRt/Opt7] ] ----
        {
            TRACE0("     CHARACTERISTIC #7 [AppRt/Opt7]\n");
            pBleCharacAppRtOpt7_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT7_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt7_g->setValue((uint16_t&)ui16AppRtOpt7_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt7 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT7_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt7);
                pBleCharacAppRtOpt7_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #8 [AppRt/Opt8] ] ----
        {
            TRACE0("     CHARACTERISTIC #8 [AppRt/Opt8]\n");
            pBleCharacAppRtOpt8_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_OPT8_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtOpt8_g->setValue((uint16_t&)ui16AppRtOpt8_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelOpt8 != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_OPT8_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelOpt8);
                pBleCharacAppRtOpt8_g->addDescriptor(pBleDescriptor);
            }
        }

        // ---- [ CHARACTERISTIC #9 [AppRt/PeerAddr] ] ----
        {
            TRACE0("     CHARACTERISTIC #9 [AppRt/PeerAddr]\n");
            pBleCharacAppRtPeerAddr_g = pBleServiceAppRt_g->createCharacteristic(
                                                            BLE_UUID_APP_RT_PEERADDR_CHARACTRSTC,
                                                            BLECharacteristic::PROPERTY_READ  |
                                                            BLECharacteristic::PROPERTY_WRITE |
                                                            BLECharacteristic::PROPERTY_NOTIFY
                                                        );
            pBleCharacAppRtPeerAddr_g->setValue(szAppRtPeerAddr_g);
            if ( (pAppDescriptData_p != NULL) && (pAppDescriptData_p->m_pszLabelPeerAddr != NULL) )
            {
                pBleDescriptor = new BLEDescriptor(BLE_UUID_APP_RT_PEERADDR_DSCRPT);
                pBleDescriptor->setValue(pAppDescriptData_p->m_pszLabelPeerAddr);
                pBleCharacAppRtPeerAddr_g->addDescriptor(pBleDescriptor);
            }
        }

        pBleServiceAppRt_g->start();
    }


    //---- Start Server ----
    TRACE0("   BleServer_g->startAdvertising()\n");
    pBleServer_g->startAdvertising();

    TRACE0("- 'ProfileSetup()'\n");

    return (1);

};



//---------------------------------------------------------------------------
//  ProfileLoop()
//---------------------------------------------------------------------------

bool  ESP32BleCfgProfile::ProfileLoop ()
{

unsigned long  ulCurrTick;
bool           fBleNotify;

    fBleNotify = false;

    if ( fBleClientConnected_g )
    {
        ulCurrTick = millis();
        if ((ulCurrTick - ui32DevMntSysTickCnt_g) >= 1000)
        {
            ui32DevMntSysTickCnt_g = ulCurrTick;
            pBleCharacDevMntSysTickCnt_g->setValue(ui32DevMntSysTickCnt_g);
            pBleCharacDevMntSysTickCnt_g->notify();

            fBleNotify = true;
        }
    }

    return (fBleNotify);

}



//---------------------------------------------------------------------------
//  IsBleClientConnected()
//---------------------------------------------------------------------------

bool  ESP32BleCfgProfile::IsBleClientConnected ()
{

    return ( fBleClientConnected_g );

}



//---------------------------------------------------------------------------
//  STATIC: ReadDataFromBleCharacterisics
//---------------------------------------------------------------------------

bool  ESP32BleCfgProfile::ReadDataFromBleCharacterisics ()
{

std::string  stdstrData;
String       strData;
uint8_t*     pui8Data;
int          iRes;
bool         fSuccess;


    TRACE0("+ 'ReadDataFromBleCharacterisics()...'\n");

    fSuccess = true;


    // ---- [DevMnt/DevName] ----
    stdstrData = pBleCharacDevMntDevName_g->getValue();
    strData = String(stdstrData.c_str());
    strncpy(szDevMntDevName_g, strData.c_str(), sizeof(szDevMntDevName_g));


    // ---- [Wifi/SSID] ----
    stdstrData = pBleCharacWifiSSID_g->getValue();
    strData = String(stdstrData.c_str());
    strncpy(szWifiSSID_g, strData.c_str(), sizeof(szWifiSSID_g));

    // ---- [Wifi/Passwd] ----
    stdstrData = pBleCharacWifiPasswd_g->getValue();
    strData = String(stdstrData.c_str());
    strncpy(szWifiPasswd_g, strData.c_str(), sizeof(szWifiPasswd_g));

    // ---- [Wifi/OwnAddr] ----
    stdstrData = pBleCharacWifiOwnAddr_g->getValue();
    strData = String(stdstrData.c_str());
    strncpy(szWifiOwnAddr_g, strData.c_str(), sizeof(szWifiOwnAddr_g));

    // ---- [Wifi/OwnMode] ----
    pui8Data = pBleCharacWifiOwnMode_g->getData();
    if (pui8Data != NULL)
    {
        ui16WifiOwnMode_g = (uint16_t)(*pui8Data);
    }


