ronaldsieber/ESP32BleConfig/ESP32BleConfig/ESP32BleCfgProfile.cpp
    // ---- [AppRt/Opt1] ----
    pui8Data = pBleCharacAppRtOpt1_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt1_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt2] ----
    pui8Data = pBleCharacAppRtOpt2_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt2_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt3] ----
    pui8Data = pBleCharacAppRtOpt3_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt3_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt4] ----
    pui8Data = pBleCharacAppRtOpt4_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt4_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt5] ----
    pui8Data = pBleCharacAppRtOpt5_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt5_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt6] ----
    pui8Data = pBleCharacAppRtOpt6_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt6_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt7] ----
    pui8Data = pBleCharacAppRtOpt7_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt7_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/Opt8] ----
    pui8Data = pBleCharacAppRtOpt8_g->getData();
    if (pui8Data != NULL)
    {
        ui16AppRtOpt8_g = (*pui8Data > 0) ? 1 : 0;
    }

    // ---- [AppRt/PeerAddr] ----
    stdstrData = pBleCharacAppRtPeerAddr_g->getValue();
    strData = String(stdstrData.c_str());
    strncpy(szAppRtPeerAddr_g, strData.c_str(), sizeof(szAppRtPeerAddr_g));

    TRACE0("- 'ReadDataFromBleCharacterisics()'\n");

    return (fSuccess);

}



//---------------------------------------------------------------------------
//  STATIC: ImportInstanceWorkspace()
//---------------------------------------------------------------------------

int  ESP32BleCfgProfile::ImportInstanceWorkspace (
        const tAppCfgData* pAppCfgData_p)
{

    TRACE0("+ 'ImportInstanceWorkspace()...'\n");

    if (pAppCfgData_p == NULL)
    {
        return (-1);
    }

    if (sizeof(szDevMntDevName_g) < sizeof(pAppCfgData_p->m_szDevMntDevName))
    {
        return (-2);
    }
    memcpy(szDevMntDevName_g, pAppCfgData_p->m_szDevMntDevName, sizeof(pAppCfgData_p->m_szDevMntDevName));

    if (sizeof(szWifiSSID_g) < sizeof(pAppCfgData_p->m_szWifiSSID))
    {
        return (-3);
    }
    memcpy(szWifiSSID_g, pAppCfgData_p->m_szWifiSSID, sizeof(pAppCfgData_p->m_szWifiSSID));

    if (sizeof(szWifiPasswd_g) < sizeof(pAppCfgData_p->m_szWifiPasswd))
    {
        return (-4);
    }
    memcpy(szWifiPasswd_g, pAppCfgData_p->m_szWifiPasswd, sizeof(pAppCfgData_p->m_szWifiPasswd));

    if (sizeof(szWifiOwnAddr_g) < sizeof(pAppCfgData_p->m_szWifiOwnAddr))
    {
        return (-5);
    }
    memcpy(szWifiOwnAddr_g, pAppCfgData_p->m_szWifiOwnAddr, sizeof(pAppCfgData_p->m_szWifiOwnAddr));

    ui16WifiOwnMode_g = (uint16_t) pAppCfgData_p->m_ui8WifiOwnMode;

    ui16AppRtOpt1_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt1 ? 1 : 0);
    ui16AppRtOpt2_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt2 ? 1 : 0);
    ui16AppRtOpt3_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt3 ? 1 : 0);
    ui16AppRtOpt4_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt4 ? 1 : 0);
    ui16AppRtOpt5_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt5 ? 1 : 0);
    ui16AppRtOpt6_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt6 ? 1 : 0);
    ui16AppRtOpt7_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt7 ? 1 : 0);
    ui16AppRtOpt8_g = (uint16_t) (pAppCfgData_p->m_fAppRtOpt8 ? 1 : 0);

    if (sizeof(szAppRtPeerAddr_g) < sizeof(pAppCfgData_p->m_szAppRtPeerAddr))
    {
        return (-6);
    }
    memcpy(szAppRtPeerAddr_g, pAppCfgData_p->m_szAppRtPeerAddr, sizeof(pAppCfgData_p->m_szAppRtPeerAddr));

    TRACE0("- 'ImportInstanceWorkspace()'\n");

    return (1);

}



//---------------------------------------------------------------------------
//  STATIC: ExportInstanceWorkspace()
//---------------------------------------------------------------------------

int  ESP32BleCfgProfile::ExportInstanceWorkspace (
        tAppCfgData* pAppCfgData_p)
{

    TRACE0("+ 'ExportInstanceWorkspace()...'\n");

    if (pAppCfgData_p == NULL)
    {
        return (-1);
    }

    memset(pAppCfgData_p, 0x00, sizeof(pAppCfgData_p));

    if (sizeof(pAppCfgData_p->m_szDevMntDevName) < sizeof(szDevMntDevName_g))
    {
        return (-2);
    }
    memcpy(pAppCfgData_p->m_szDevMntDevName, szDevMntDevName_g, sizeof(pAppCfgData_p->m_szDevMntDevName));

    if (sizeof(pAppCfgData_p->m_szWifiSSID) < sizeof(szWifiSSID_g))
    {
        return (-3);
    }
    memcpy(pAppCfgData_p->m_szWifiSSID, szWifiSSID_g, sizeof(pAppCfgData_p->m_szWifiSSID));

    if (sizeof(pAppCfgData_p->m_szWifiPasswd) < sizeof(szWifiPasswd_g))
    {
        return (-4);
    }
    memcpy(pAppCfgData_p->m_szWifiPasswd, szWifiPasswd_g, sizeof(pAppCfgData_p->m_szWifiPasswd));

    if (sizeof(pAppCfgData_p->m_szWifiOwnAddr) < sizeof(szWifiOwnAddr_g))
    {
        return (-5);
    }
    memcpy(pAppCfgData_p->m_szWifiOwnAddr, szWifiOwnAddr_g, sizeof(pAppCfgData_p->m_szWifiOwnAddr));

    pAppCfgData_p->m_ui8WifiOwnMode = (uint8_t)ui16WifiOwnMode_g;

    pAppCfgData_p->m_fAppRtOpt1 = (ui16AppRtOpt1_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt2 = (ui16AppRtOpt2_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt3 = (ui16AppRtOpt3_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt4 = (ui16AppRtOpt4_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt5 = (ui16AppRtOpt5_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt6 = (ui16AppRtOpt6_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt7 = (ui16AppRtOpt7_g == 0) ? false : true;
    pAppCfgData_p->m_fAppRtOpt8 = (ui16AppRtOpt8_g == 0) ? false : true;

    if (sizeof(pAppCfgData_p->m_szAppRtPeerAddr) < sizeof(szAppRtPeerAddr_g))
    {
        return (-6);
    }
    memcpy(pAppCfgData_p->m_szAppRtPeerAddr, szAppRtPeerAddr_g, sizeof(pAppCfgData_p->m_szAppRtPeerAddr));

    TRACE0("- 'ExportInstanceWorkspace()'\n");

    return (1);

}





/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//          P R I V A T E    M E T H O D E S                               //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////




//  EOF
